{
    "data": [
        {
            "title": "PortfolioV2 Website",
            "url": "https://0necloud.netlify.app/",
            "images": [
                "res/images/projects/PortfolioV2/1.png"
            ],
            "date": "2024",
            "badges": [
                "Vue.js",
                "Three.js"
            ],
            "description": "This is my second take at creating a portfolio website, where I decided to try out Vue's Composition API for the first time. Unlike my PortfolioV1 site, here I have decided to go for a single-scrollable page and also build it completely from scratch, exploring different ways of organising my file structure and data."
        },
        {
            "title": "Game Wiki Site",
            "url": "https://dungeonslasher.wiki/",
            "images": [
                "res/images/projects/DSInfo/1.png",
                "res/images/projects/DSInfo/2.png",
                "res/images/projects/DSInfo/3.png",
                "res/images/projects/DSInfo/4.png",
                "res/images/projects/DSInfo/5.png",
                "res/images/projects/DSInfo/6.png"
            ],
            "date": "2024",
            "badges": [
                "Vue.js",
                "SEO"
            ],
            "description": "Dungeon Slasher is a mobile game for which I have created a wiki site from scratch for. Through this project, I have gotten first hand experience with purchasing my own domain, setting DNS records, monitor traffic through the Google Search Console and also learn basic SEO techniques to help my site appear more on Search Engines.\n\nI have also created a similar site for a game which has ended service, and will not be maintaining the site any longer: https://revivedwitch.netlify.app/"
        },
        {
            "title": "Audio Visualiser",
            "url": "https://bavisualiser.netlify.app/",
            "images": [
                "res/images/projects/AudioVisualiser/1.png",
                "res/images/projects/AudioVisualiser/2.png",
                "res/images/projects/AudioVisualiser/3.png",
                "res/images/projects/AudioVisualiser/4.png"
            ],
            "date": "2024",
            "badges": [
                "Vue.js",
                "Three.js",
                "Web Audio API"
            ],
            "description": "A fun yet painful project I undertook to experiment using Three.js. Integrates the Web Audio API to convert audio into visuals.\n\nAllows users to\n1. Stream audio by sharing their tabs / windows / screens (Desktop only and browser-dependent)\n2. Upload an audio file.\n\nThree.js implemented effects include:\n1. Bouncing & Colour-Changing Halo\n2. STL 3D Halos with textures\n3. Audio Bars\n\nDemo: https://0necloud.github.io/audio-visualiser/\nSource Code: https://github.com/0necloud/audio-visualiser"
        },
        {
            "title": "RSHub",
            "url": "https://0necloud.github.io/RSHub/",
            "images": [
                "res/images/projects/RSHub/1.jpg",
                "res/images/projects/RSHub/2.jpg"
            ],
            "date": "2024",
            "badges": [
                "Vue.js"
            ],
            "description": "Vue.js application that provides searching of a resource JSON object containing a defined set of keys. Essentially a hub containing urls to different resources.\n\nSource: https://github.com/0necloud/RSHub"
        },
        {
            "title": "PortfolioV1 Website",
            "url": "#",
            "images": [
                "res/images/projects/PortfolioV1/1.png",
                "res/images/projects/PortfolioV1/2.png",
                "res/images/projects/PortfolioV1/3.png",
                "res/images/projects/PortfolioV1/4.png"
            ],
            "date": "2024",
            "badges": [
                "Vue.js"
            ],
            "description": "A site built for my portfolio to practice my front-end web development skills using the Vue.js framework. Made this to keep myself busy during my National Service period and to not lose touch of my web development skills.\n\nUses components from PrimeVue and the style classes from the Sakai template. However, I have heavily modified the original layout and redesigned a large portion of the template.\n\nhttps://github.com/0necloud/0necloud.github.io"
        },
        {
            "title": "Secured Smartfarms Control and Monitoring System",
            "url": "#",
            "images": [
                "res/images/projects/SSCaMS/1.jpg",
                "res/images/projects/SSCaMS/2.png",
                "res/images/projects/SSCaMS/3.png",
                "res/images/projects/SSCaMS/4.png",
                "res/images/projects/SSCaMS/5.png",
                "res/images/projects/SSCaMS/6.png",
                "res/images/projects/SSCaMS/7.png",
                "res/images/projects/SSCaMS/8.png",
                "res/images/projects/SSCaMS/9.png"
            ],
            "date": "2022",
            "badges": [
                "Vue.js",
                "Socket.IO",
                "Redis",
                "IoT"
            ],
            "description": "Countless industries are benefiting from ever improving and everchanging technologies, yet many agricultural processes still have room for improvement. The web application, as part of my polytechnic's year 3 Final Year Project with Leaptron Engineering Pte Ltd, was built for overseeing administration and monitoring of crops is just one of the many possible solutions. The objective of solutions should be self-sustainability by increasing yield and reducing costs and wasted resources through increased efficiency.\n\nThe web application makes use of sockets to receive sensor data from farming racks, where it is processed on the backend and forwarded to the dashboard. On top of monitoring crop growth and conditions, numerous security features have been built into the system, including JSON Web Tokens for authentication, Role-based Access Control, Password Policies, Account Lockout, Logging, and more. It also allows the receiving of notifications via a Telegram bot and through emails.\n\nThrough this project, I have learnt how to do database modelling and implement stored procedures in MariaDB, caching data in Redis, and implement multiple web application security features. During the course of the FYP, we have also learnt to use the SCRUM methodology for project management, which allowed us to meticulously plan out our project timeline and tasks."
        },
        {
            "title": "SP Shirts",
            "url": "#",
            "images": [
                "res/images/projects/SPShirts/1.jpg",
                "res/images/projects/SPShirts/2.jpg",
                "res/images/projects/SPShirts/3.jpg"
            ],
            "date": "2022",
            "badges": [
                "Web Application Security"
            ],
            "description": "This is my polytechnic's year 2 assignment for the Secure Coding module. Given an extremely vulnerable web application, my buddy and I have found and categorized the various vulnerabilities with reference to the OWASP Top Ten Web Application Security Risks, after which we have implemented fixes to. Examples of vulnerabilties addressed are:\n\n1. Privilege Escalation\n2. Insecure Direct Object References\n3. SQL Injection\n4. XSS Injection\n5. Lack of encryption (at rest & in transit)\n6. Credential Stuffing.\n\nIn the process of researching on the various vulnerabilties, we have created proof-of-concepts such as using webhooks for XSS attacks and brute-forcing tools. In the implementation of protection against the attacks, we have learnt to implement HTTPS for securing our data in transit, multi-factor authentication, account lockout, and more. All of these were knowledge not covered in school, but done through research and testing."
        },
        {
            "title": "SP Movies",
            "url": "#",
            "images": [
                "res/images/projects/SPMovies/1.jpg",
                "res/images/projects/SPMovies/2.jpg"
            ],
            "date": "2022",
            "badges": [
                "JWT",
                "MySQL"
            ],
            "description": "This is my polytechnic's year 2 assignment for the Back-End Web Development module. Here, I got to learn how to use MySQL and create databases, develop endpoints, and implement JWT authentication for security."
        },
        {
            "title": "SPAM2 System",
            "url": "#",
            "images": [
                "res/images/projects/SPAM2/1.jpg",
                "res/images/projects/SPAM2/2.jpg",
                "res/images/projects/SPAM2/3.jpg"
            ],
            "date": "2022",
            "badges": [
                "Public Key Cryptography"
            ],
            "description": "This is my polytechnic's year 1 assignment for the Applied Cryptography module. It consists of a server and client, where the client sends a request for a menu at the start of the day and sends a CSV file back at the end of the day. The original assignment code sends the data in cleartext, and we were supposed to modify the system to provide Confidentiality, Integrity, and Non-Repudiation of data.\n\nIn order to achieve this, we integrated a Public Key Infrastructure, hashing, and AES encryption. As an addition, we also developed a simple GUI to stand out from the other assignment submissions. "
        },
        {
            "title": "Front-End Website",
            "url": "https://0necloud.github.io/front-end-website/",
            "images": [
                "res/images/projects/FED/1.jpg"
            ],
            "date": "2020",
            "badges": [
                "Bootstrap",
                "HTML",
                "CSS",
                "JS"
            ],
            "description": "This was my polytechnic's year 1 assignment for the Front-End Web Development module. It incorporates the use of Bootstrap for mobile responsiveness, and implements simple JavaScript functionalities such as a countdown timer and form selection.\n\nhttps://github.com/0necloud/front-end-website"
        },
        {
            "title": "MikuXSmiku",
            "url": "https://github.com/0necloud/MikuXSmiku",
            "images": [
                "res/images/projects/MikuXSmiku/1.jpg",
                "res/images/projects/MikuXSmiku/2.jpg",
                "res/images/projects/MikuXSmiku/3.jpg"
            ],
            "date": "2021",
            "badges": [
                "Tkinter",
                "Turtle"
            ],
            "description": "A fun little project I took on to make a game in Python. Play as the famous Hatsune Miku or Sakura Miku and throw leeks and cherries and each other until one player's HP falls below zero! Fire projectiles at orbs (Battle Ether) to earn points which can be used to activate abilities (Large Projectile/Healing)! All of this while listening to Hatsune Miku's hit songs! \n\nNote: The assets are NOT made by me, and this is meant to be a fun little side project. "
        },
        {
            "title": "Python Drawing Programme",
            "url": "https://github.com/0necloud/draw",
            "images": [
                "res/images/projects/drawapp/1.jpg"
            ],
            "date": "2021",
            "badges": [
                "Tkinter",
                "Turtle"
            ],
            "description": "This was the first project which I have embarked on. This drawing programme uses gamified WASD controls to move the cursor, and offers options to change the pen and canvas colors. It also allows the user to save the current artwork as a local file, although improvements need to be made."
        }
    ]
}